Autodesk.Revit.UI.Events.TransferringProjectStandardsEventArgs.SetExternalItems(System.Collections.Generic.IDictionary{System.Guid,System.String})
Sets the collection of externally added items which should be shown in the Transfer Project Standards dialog as options.
Remarks:
The externally added items that the user opted to transfer will be reported in the args to the TransferredProjectStandards event.
externalItems:
The external items which are displayed in the Transfer Project Standards UI.
GUIDvalue is used to identify the external item string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017.2

Autodesk.Revit.UI.Events.TransferringProjectStandardsEventArgs.GetExternalItems
Gets the collection of externally added items which should be shown in the Transfer Project Standards dialog as options.
Returns:
The external items which are displayed in the Transfer Project Standards UI.
GUIDvalue is used to identify the external item string.
Since:
2017.2

Autodesk.Revit.UI.Events.TransferringProjectStandardsEventArgs.TargetDocument
Target document.
Since:
2017.2

Autodesk.Revit.UI.Events.TransferringProjectStandardsEventArgs.SourceDocument
Source document.
Since:
2017.2

Autodesk.Revit.UI.Events.TransferringProjectStandardsEventArgs
The event arguments used by the TransferringProjectStandards event.
Since:
2017.2